# GridHeadTag Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..GridHeadTag Property
ParameterTypeId Class See Also
---
"Symbol"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId GridHeadTag { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property GridHeadTag As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ GridHeadTag {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace